cheatsheat.org
#+title: Cheatsheat

*** Matchings

*Matching:* Subset of edges  that do not have a common endpoint.

Matching M is *maximum* if there is no matching with more number of edges.

A *maximal* matching is a matching M to which no other edges can be added.

Given a matching M in an undirected graph $G=(V,E)$, an *M-alternating* path is a simple path whose edges alternate between being in M and being in $E-M$.

*M-augmenting path* (sometimes called an augmenting path with respect to M ): an M-alternating path whose first and last edges belong to $E-M$ (not in the matching). This means the first and last vertex are also unmatched. <<maug>>

Larger matching M': exchange edges of M-augmenting path P
- $e\in P \setminus M$ (edges in the path but not in the matching): put in M'
- $e\in P\cap M$ (edges in both the path and the matching): don’t put in M'
- Other edges of M: put in M'

Matching M in graph G is maximum if and only if there is no M-augmenting path in G.


*Bipartite graph* is a graph whose vertices can be divided into two disjoint and independent sets $U$ and $V$. Every edge connects a vertex in $U$ to one in $V$.

To find an M-augmenting path, we use an *auxillary graph*:
- direct the edges of the bipartite graph as follows:
  - If $e\in M$, direct it from right to left.
  - If $e \notin M$, direct it from left to right.

#+begin_src python
Algorithm FindBipMAugmenting(G, M)
  Make directed aux. graph for G as in last slide
  Find source-sink path P with DFS in aux. graph
  If path P found, then P is a M-augmenting path
  No path found? Then M is maximum
#+end_src

Running time: $O(n+m)$

#+begin_src python
Algorithm BipMaxMatching(G)
   M = {}
      while P = FindBipMAugmenting(G, M)
      do exchange edges of P (augment M)
   return M
#+end_src

Running time: $O(n(n+m)) = O(nm)$

*Bipartite graphs*

Hopcroft-karp algorithm: $O(m\sqrt n)$

*Weighted maximum matching*

From a graph with weighted edges $w:E(G)\rightarrow \mathbb{R}$ find matching of largest possible total weight.

In bipartite graphs: make directed auxillary graph.
- set $length(e)= -w(e)\ if\ e \in E(G)\setminus M$
- set $length(e)= w(e)\ if\ e \in M$

Then find the shortest M-augmenting path.

Finding weigted maximmum matching in bipartite graph: Gabow-Tarjan [1988]: $O(m\sqrt n \log (nW))$

*Matching on general graphs*

Matchings on general paths is much harder, best time complexity is $O(n^2m)$ Micali-Vazirani [1980], not taught in this course.

*Weighted general graphs*

Gabow [1990]: $O(n (m + n \log n))$

The *stable-marriage problem*:
- comes from the notion of heterosexual marriage, viewing L as a set of women and R as a set of men.
- Each woman ranks all the men in terms of desirability, and each man does the same with all the women.
- The goal is to pair up women and men (a matching) so that if a woman and a man are not matched to each other, then at least one of them prefers their assigned partner.
- A men and a woman are a *blocking pair* if they are not matched but each prefers the other over their assigned partner.
  - Such a pair prevents a a matching from being stable: *unstable*
- A *stable* matching is a matching that has no blocking pairs
- A stable matching is always possible

The Gale–Shapley algorithm: $O(n^2)$
