cheatsheat.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-07 Sun 22:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cheatsheat</title>
<meta name="author" content="martijnV" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Cheatsheat</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb63326e">1. Matchings</a></li>
<li><a href="#org2645f4a">2. Flow and cuts</a></li>
<li><a href="#org329582a">3. Amortized analysis</a></li>
<li><a href="#org686b043">4. Minimum spanning trees and Union find</a></li>
<li><a href="#org13e479b">5. NP-completeness</a></li>
<li><a href="#org22feb18">6. String Matching</a></li>
<li><a href="#org54d3a23">7. Gerandomiseerde algoritmes</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgb63326e" class="outline-2">
<h2 id="orgb63326e"><span class="section-number-2">1.</span> Matchings</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Matching:</b> Subset of edges  that do not have a common endpoint.
</p>

<p>
Matching M is <b>maximum</b> if there is no matching with more number of edges.
</p>

<p>
A <b>maximal</b> matching is a matching M to which no other edges can be added.
</p>

<p>
Given a matching M in an undirected graph \(G=(V,E)\), an <b>M-alternating</b> path is a simple path whose edges alternate between being in M and being in \(E-M\).
</p>

<p>
<b>M-augmenting path</b> (sometimes called an augmenting path with respect to M ): an M-alternating path whose first and last edges belong to \(E-M\) (not in the matching). This means the first and last vertex are also unmatched. <a id="orge403c64"></a>
</p>

<p>
Larger matching M&rsquo;: exchange edges of M-augmenting path P
</p>
<ul class="org-ul">
<li>\(e\in P \setminus M\) (edges in the path but not in the matching): put in M&rsquo;</li>
<li>\(e\in P\cap M\) (edges in both the path and the matching): don’t put in M&rsquo;</li>
<li>Other edges of M: put in M&rsquo;</li>
</ul>

<p>
Matching M in graph G is maximum if and only if there is no M-augmenting path in G.
</p>


<p>
<b>Bipartite graph</b> is a graph whose vertices can be divided into two disjoint and independent sets \(U\) and \(V\). Every edge connects a vertex in \(U\) to one in \(V\).
</p>

<p>
To find an M-augmenting path, we use an <b>auxillary graph</b>:
</p>
<ul class="org-ul">
<li>direct the edges of the bipartite graph as follows:
<ul class="org-ul">
<li>If \(e\in M\), direct it from right to left.</li>
<li>If \(e \notin M\), direct it from left to right.</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-python">Algorithm FindBipMAugmenting(G, M)
  Make directed aux. graph <span style="color: #cba6f7;">for</span> G <span style="color: #cba6f7;">as</span> <span style="color: #cba6f7;">in</span> last slide
  Find source<span style="color: #89dceb;">-</span>sink path P <span style="color: #cba6f7;">with</span> DFS <span style="color: #cba6f7;">in</span> aux. graph
  If path P found, then P <span style="color: #cba6f7;">is</span> a M<span style="color: #89dceb;">-</span>augmenting path
  No path found? Then M <span style="color: #cba6f7;">is</span> maximum
</pre>
</div>

<p>
Running time: \(O(n+m)\)
</p>

<div class="org-src-container">
<pre class="src src-python">Algorithm BipMaxMatching(G)
   <span style="color: #cdd6f4;">M</span> <span style="color: #89dceb;">=</span> {}
      <span style="color: #cba6f7;">while</span> P <span style="color: #89dceb;">=</span> FindBipMAugmenting(G, M)
      do exchange edges of P (augment M)
   <span style="color: #cba6f7;">return</span> M
</pre>
</div>

<p>
Running time: \(O(n(n+m)) = O(nm)\)
</p>

<p>
<b>Bipartite graphs</b>
</p>

<p>
Hopcroft-karp algorithm: \(O(m\sqrt n)\)
</p>

<p>
<b>Weighted maximum matching</b>
</p>

<p>
From a graph with weighted edges \(w:E(G)\rightarrow \mathbb{R}\) find matching of largest possible total weight.
</p>

<p>
In bipartite graphs: make directed auxillary graph.
</p>
<ul class="org-ul">
<li>set \(length(e)= -w(e)\ if\ e \in E(G)\setminus M\)</li>
<li>set \(length(e)= w(e)\ if\ e \in M\)</li>
</ul>

<p>
Then find the shortest M-augmenting path.
</p>

<p>
Finding weigted maximmum matching in bipartite graph: Gabow-Tarjan [1988]: \(O(m\sqrt n \log (nW))\)
</p>

<p>
<b>Matching on general graphs</b>
</p>

<p>
Matchings on general paths is much harder, best time complexity is \(O(n^2m)\) Micali-Vazirani [1980], not taught in this course.
</p>

<p>
<b>Weighted general graphs</b>
</p>

<p>
Gabow [1990]: \(O(n (m + n \log n))\)
</p>

<p>
The <b>stable-marriage problem</b>:
</p>
<ul class="org-ul">
<li>comes from the notion of heterosexual marriage, viewing L as a set of women and R as a set of men.</li>
<li>Each woman ranks all the men in terms of desirability, and each man does the same with all the women.</li>
<li>The goal is to pair up women and men (a matching) so that if a woman and a man are not matched to each other, then at least one of them prefers their assigned partner.</li>
<li>A men and a woman are a <b>blocking pair</b> if they are not matched but each prefers the other over their assigned partner.
<ul class="org-ul">
<li>Such a pair prevents a a matching from being stable: <b>unstable</b></li>
</ul></li>
<li>A <b>stable</b> matching is a matching that has no blocking pairs</li>
<li>A stable matching is always possible</li>
</ul>

<p>
The Gale–Shapley algorithm: \(O(n^2)\)
</p>
</div>
</div>
