cheatsheat.org
*** Flow and cuts
A flow network
- A directed graph $G = (V, A)$
- For every arc $(u, v) \in A$,
- There is a *capacity* denoted by $c(u, v) \ge 0$.
- There are two special vertices called the source and the sink such that all the arcs incident on the source are outgoing and all the arcs incident on the sink are incoming arcs.
  - *Source:* $s$ arcs incident on the source are outgoing
  - *Sink:* $t$ arcs incident on the sink are incoming

If we want a network with multiple sources and sinks we add a *super sink* and a *super source* such that there are arcs from the super source to every source vertex and arcs from every sink vertex to the super sink.

*Flow:* A flow in any network $G=(V,A)$ can be defined as a function $f:A\rightarrow  \mathbb R$ such that it follows the following rules:
- *Capacity Constraint*: $f (a) \le c(a)$, for all $a\in A$
- *Conservation of flow*: For every vertex v other than the source and the sink, the total flow going into the vertex equals the flow going out of it.
  - That is $\sum_{u:(u,v)\in A}f((u,v))=\sum_{u:(v,u)\in A}f((v,u))$

*Value of flow*: The total value of flow in a given flow network
- $|f|=\sum_{u:(s,u)\in A}f((s,u))=\sum_{u:(u,t)\in A}f((u,t))$
- The total sum going from the source or the total sum going into the sink.

Finding a maximum matching in a bipartite graph can be modeled as a max-flow problem.

Given bipartite graph $G=(U\cup V, E)$, to create the flow network $G'$:
- Direct all the edges in $G$ from $U$ to $V$ and assign a capacity of $1$ to each.
- Add a source vertex $s$ and add arcs of capacity $1$ directed from $s$ to each vertex in $u\in U$
- Add a sink vertex $t$ and add arcs of capacity $1$ directed from each vertex in $v\in V$ to $t$.

Finding a maximum flow in $G'$ amounts to finding a maximum matching in the bipartite graph G.

- Given: bipartite graph $G=(UV, E)$ with a capacity $c(v)$ for every $v$ in $UV$
- Wanted: The largest subset of edges $M \subseteq E$ such that every vertex $v$ in $U V$ is the endpoint of at most $c(v)$ edges in $M$
- Example application: U are workers who can do c(v) tasks. V are tasks with c(w)=1

Translate bipartite graph into flow network by appropriately assigning capacities to arcs.

The vertices also need to have capacities, this is modelled by translating the vertices to two vertices and a edge.

The Ford-Fulkerson Algorithm iteratively increases the value of flow. It starts with $f(u,v)=0$ for all $u,v\in V$, giving an initial flow of 0. Each iteration increases the flow value in G by finding an augmenting path in an associated residual network $G_f$.

*Residual Network:*
- Let $f$ be a flow in the network $G = (V, A)$ with capacities $c$.
- The residual network $G_f$:
- For every arc $(v,w)$ in A:
  - If $f (v, w) < c(v, w)$, then $(v, w)$ is a forward arc in $G_f$ of residual capacity
    $c_f (v, w) = c(v, w) - f (v, w)$
  - If $f (v, w) > 0$, then $(w, v)$ is a backward arc in $G_f$ of residual capacity $c_f (w, v) = f (v, w)$

The residual network gives us an overview of possible improvement/augmentation of flow. As long as there is an s - t path in the residual network, it is possible to augment the flow.

*Ford-Fulkerson Algorithm*
#+begin_src python
f: f(v,w) = 0 for all (v,w) in A
Construct residual network G_f
while There is a path P from s to t in G_f do:
    x = min{c_f(v,w)|(v,w) in P}
    for (v,w) in P do:
        if (v,w) is forward arc then:
            f(v,w) = f(v,w) + x
        else:
            f(v,w) = f(v,w) - x
return f
#+end_src

The edges of the augmenting path in $G_f$ indicate on which edges in $G$ to update the flow in order to increase the flow value.

Let $f$ be the flow in $G$ and $g$ be the flow in $G_f$. We define the *augmented flow* as:

\begin{equation}
(f+g)(u,v)=
\begin{cases}
f(u,v)+g(u,v)-g(v,u) & \text{if}(u,v) \in E(G)\\
0 & \text{otherwise} \\
\end{cases}
\end{equation}

An s-t-*cut* in a network $G = (V, A)$ is a partition of the vertices into two sets $S$ and $T$, such that
- $S\cup T=V$
- $S\cap T=\emptyset$
- $s\in S$ and $t\in T$

The *capacity* of a cut $(S, T )$ is the sum of capacities of all the edges going from $S$ to $T$:
- $c(S, T)=\sum_{v\in S,w\in T:(v,w)\in A} c(v,w)$

The flow over cut:
- $f(S, T)=\sum_{v\in S,w\in T:(v,w)\in A} f(v,w)$

For every s-t cut $(S,T): f(S,T)\le c(S,T)$, from this it follows that $|f| \le c(S,T)$.
- It means that if we find a cut in G of capacity c, there cannot exist a flow in G of value greater than c.
- Likewise, if we found a flow value $c^*$ in G, we cannot find a cut of capacity less than $c^*$.

The two above observations leads us to the following theorem:

*Max-Flow Min-Cut Theorem:* he maximum value of flow in a network G is equal to the capacity of a cut of smallest capacity.

Finding a minimum cut:
- Assign all arcs capacity 1
- Find maximum flow, for ex. using Ford-Fulk.
- Determine S: all vertices reachable from s in $G_f$
- Output set of arcs in G from S to V – S

#+begin_src python
procedure Edmonds-Karp(G, c):
    f: f(v,w) = 0 for all (v,w) in A
    Construct residual network G_f
    Find the shortest path P from s to t
      in Gf using BFS
    if P exists then
        x = min{cf (v, w) | (v, w) ∈ P }
        for (v, w) ∈ P do
            if (v, w) is forward arc then
                f (v, w) = f (v, w) + x
            else
                f (v, w) = f (v, w) − x
#+end_src

