cheatsheat.html
<div id="outline-container-org2645f4a" class="outline-2">
<h2 id="org2645f4a"><span class="section-number-2">2.</span> Flow and cuts</h2>
<div class="outline-text-2" id="text-2">
<p>
A flow network
</p>
<ul class="org-ul">
<li>A directed graph \(G = (V, A)\)</li>
<li>For every arc \((u, v) \in A\),</li>
<li>There is a <b>capacity</b> denoted by \(c(u, v) \ge 0\).</li>
<li>There are two special vertices called the source and the sink such that all the arcs incident on the source are outgoing and all the arcs incident on the sink are incoming arcs.
<ul class="org-ul">
<li><b>Source:</b> \(s\) arcs incident on the source are outgoing</li>
<li><b>Sink:</b> \(t\) arcs incident on the sink are incoming</li>
</ul></li>
</ul>

<p>
If we want a network with multiple sources and sinks we add a <b>super sink</b> and a <b>super source</b> such that there are arcs from the super source to every source vertex and arcs from every sink vertex to the super sink.
</p>

<p>
<b>Flow:</b> A flow in any network \(G=(V,A)\) can be defined as a function \(f:A\rightarrow  \mathbb R\) such that it follows the following rules:
</p>
<ul class="org-ul">
<li><b>Capacity Constraint</b>: \(f (a) \le c(a)\), for all \(a\in A\)</li>
<li><b>Conservation of flow</b>: For every vertex v other than the source and the sink, the total flow going into the vertex equals the flow going out of it.
<ul class="org-ul">
<li>That is \(\sum_{u:(u,v)\in A}f((u,v))=\sum_{u:(v,u)\in A}f((v,u))\)</li>
</ul></li>
</ul>

<p>
<b>Value of flow</b>: The total value of flow in a given flow network
</p>
<ul class="org-ul">
<li>\(|f|=\sum_{u:(s,u)\in A}f((s,u))=\sum_{u:(u,t)\in A}f((u,t))\)</li>
<li>The total sum going from the source or the total sum going into the sink.</li>
</ul>

<p>
Finding a maximum matching in a bipartite graph can be modeled as a max-flow problem.
</p>

<p>
Given bipartite graph \(G=(U\cup V, E)\), to create the flow network \(G'\):
</p>
<ul class="org-ul">
<li>Direct all the edges in \(G\) from \(U\) to \(V\) and assign a capacity of \(1\) to each.</li>
<li>Add a source vertex \(s\) and add arcs of capacity \(1\) directed from \(s\) to each vertex in \(u\in U\)</li>
<li>Add a sink vertex \(t\) and add arcs of capacity \(1\) directed from each vertex in \(v\in V\) to \(t\).</li>
</ul>

<p>
Finding a maximum flow in \(G'\) amounts to finding a maximum matching in the bipartite graph G.
</p>

<ul class="org-ul">
<li>Given: bipartite graph \(G=(UV, E)\) with a capacity \(c(v)\) for every \(v\) in \(UV\)</li>
<li>Wanted: The largest subset of edges \(M \subseteq E\) such that every vertex \(v\) in \(U V\) is the endpoint of at most \(c(v)\) edges in \(M\)</li>
<li>Example application: U are workers who can do c(v) tasks. V are tasks with c(w)=1</li>
</ul>

<p>
Translate bipartite graph into flow network by appropriately assigning capacities to arcs.
</p>

<p>
The vertices also need to have capacities, this is modelled by translating the vertices to two vertices and a edge.
</p>

<p>
The Ford-Fulkerson Algorithm iteratively increases the value of flow. It starts with \(f(u,v)=0\) for all \(u,v\in V\), giving an initial flow of 0. Each iteration increases the flow value in G by finding an augmenting path in an associated residual network \(G_f\).
</p>

<p>
<b>Residual Network:</b>
</p>
<ul class="org-ul">
<li>Let \(f\) be a flow in the network \(G = (V, A)\) with capacities \(c\).</li>
<li>The residual network \(G_f\):</li>
<li>For every arc \((v,w)\) in A:
<ul class="org-ul">
<li>If \(f (v, w) < c(v, w)\), then \((v, w)\) is a forward arc in \(G_f\) of residual capacity
\(c_f (v, w) = c(v, w) - f (v, w)\)</li>
<li>If \(f (v, w) > 0\), then \((w, v)\) is a backward arc in \(G_f\) of residual capacity \(c_f (w, v) = f (v, w)\)</li>
</ul></li>
</ul>

<p>
The residual network gives us an overview of possible improvement/augmentation of flow. As long as there is an s - t path in the residual network, it is possible to augment the flow.
</p>

<p>
<b>Ford-Fulkerson Algorithm</b>
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #cdd6f4;">f</span>: f(<span style="color: #cdd6f4;">v</span>,<span style="color: #cdd6f4;">w</span>) <span style="color: #89dceb;">=</span> <span style="color: #fab387;">0</span> <span style="color: #cba6f7;">for</span> <span style="color: #f38ba8;">all</span> (v,w) <span style="color: #cba6f7;">in</span> A
Construct residual network G_f
<span style="color: #cba6f7;">while</span> There <span style="color: #cba6f7;">is</span> a path P <span style="color: #cba6f7;">from</span> s to t <span style="color: #cba6f7;">in</span> G_f do:
    <span style="color: #cdd6f4;">x</span> <span style="color: #89dceb;">=</span> <span style="color: #f38ba8;">min</span>{c_f(v,w)<span style="color: #89dceb;">|</span>(v,w) <span style="color: #cba6f7;">in</span> P}
    <span style="color: #cba6f7;">for</span> (v,w) <span style="color: #cba6f7;">in</span> P do:
        <span style="color: #cba6f7;">if</span> (v,w) <span style="color: #cba6f7;">is</span> forward arc then:
            f(<span style="color: #cdd6f4;">v</span>,<span style="color: #cdd6f4;">w</span>) <span style="color: #89dceb;">=</span> f(v,w) <span style="color: #89dceb;">+</span> x
        <span style="color: #cba6f7;">else</span>:
            f(<span style="color: #cdd6f4;">v</span>,<span style="color: #cdd6f4;">w</span>) <span style="color: #89dceb;">=</span> f(v,w) <span style="color: #89dceb;">-</span> x
<span style="color: #cba6f7;">return</span> f
</pre>
</div>

<p>
The edges of the augmenting path in \(G_f\) indicate on which edges in \(G\) to update the flow in order to increase the flow value.
</p>

<p>
Let \(f\) be the flow in \(G\) and \(g\) be the flow in \(G_f\). We define the <b>augmented flow</b> as:
</p>

\begin{equation}
(f+g)(u,v)=
\begin{cases}
f(u,v)+g(u,v)-g(v,u) & \text{if}(u,v) \in E(G)\\
0 & \text{otherwise} \\
\end{cases}
\end{equation}

<p>
An s-t-<b>cut</b> in a network \(G = (V, A)\) is a partition of the vertices into two sets \(S\) and \(T\), such that
</p>
<ul class="org-ul">
<li>\(S\cup T=V\)</li>
<li>\(S\cap T=\emptyset\)</li>
<li>\(s\in S\) and \(t\in T\)</li>
</ul>

<p>
The <b>capacity</b> of a cut \((S, T )\) is the sum of capacities of all the edges going from \(S\) to \(T\):
</p>
<ul class="org-ul">
<li>\(c(S, T)=\sum_{v\in S,w\in T:(v,w)\in A} c(v,w)\)</li>
</ul>

<p>
The flow over cut:
</p>
<ul class="org-ul">
<li>\(f(S, T)=\sum_{v\in S,w\in T:(v,w)\in A} f(v,w)\)</li>
</ul>

<p>
For every s-t cut \((S,T): f(S,T)\le c(S,T)\), from this it follows that \(|f| \le c(S,T)\).
</p>
<ul class="org-ul">
<li>It means that if we find a cut in G of capacity c, there cannot exist a flow in G of value greater than c.</li>
<li>Likewise, if we found a flow value \(c^*\) in G, we cannot find a cut of capacity less than \(c^*\).</li>
</ul>

<p>
The two above observations leads us to the following theorem:
</p>

<p>
<b>Max-Flow Min-Cut Theorem:</b> he maximum value of flow in a network G is equal to the capacity of a cut of smallest capacity.
</p>

<p>
Finding a minimum cut:
</p>
<ul class="org-ul">
<li>Assign all arcs capacity 1</li>
<li>Find maximum flow, for ex. using Ford-Fulk.</li>
<li>Determine S: all vertices reachable from s in \(G_f\)</li>
<li>Output set of arcs in G from S to V – S</li>
</ul>

<div class="org-src-container">
<pre class="src src-python">procedure Edmonds<span style="color: #89dceb;">-</span>Karp(G, c):
    <span style="color: #cdd6f4;">f</span>: f(<span style="color: #cdd6f4;">v</span>,<span style="color: #cdd6f4;">w</span>) <span style="color: #89dceb;">=</span> <span style="color: #fab387;">0</span> <span style="color: #cba6f7;">for</span> <span style="color: #f38ba8;">all</span> (v,w) <span style="color: #cba6f7;">in</span> A
    Construct residual network G_f
    Find the shortest path P <span style="color: #cba6f7;">from</span> s to t
      <span style="color: #cba6f7;">in</span> Gf using BFS
    <span style="color: #cba6f7;">if</span> P exists then
        <span style="color: #cdd6f4;">x</span> <span style="color: #89dceb;">=</span> <span style="color: #f38ba8;">min</span>{cf (v, w) <span style="color: #89dceb;">|</span> (v, w) &#8712; P }
        <span style="color: #cba6f7;">for</span> (v, w) &#8712; P do
            <span style="color: #cba6f7;">if</span> (v, w) <span style="color: #cba6f7;">is</span> forward arc then
                f (<span style="color: #cdd6f4;">v</span>, <span style="color: #cdd6f4;">w</span>) <span style="color: #89dceb;">=</span> f (v, w) <span style="color: #89dceb;">+</span> x
            <span style="color: #cba6f7;">else</span>
                f (<span style="color: #cdd6f4;">v</span>, <span style="color: #cdd6f4;">w</span>) <span style="color: #89dceb;">=</span> f (v, w) &#8722; x
</pre>
</div>
</div>
</div>
