cheatsheat.org
*** Amortized analysis

*Amortized analysis:* Find the amortized time complexity $a^i$ for the i'th operation such that $\sum^n_{i=1}t_i \le\sum^n_{i=1}a_i \le f(n)$


*Aggregate method* is a method to find the amortized complexity of a operation.

$$\text{amortized time for each operation} = \frac{\text{total time complexity}}{\text{number of operations}}$$

1. Calculate the total time complexity over the sequence of operations
   - You may need some parameters to help you calculate
     - There are PUSHs in the super stack example
2. Divide the total time complexity by the number of the operations. The result is the amortized cost per operation
   - Using aggregate method, every operation has the same amortized cost

*Accounting method* is a method to find the amortized complexity of a operation.
- Instead of averaging the cost evenly on each of the operations, we design the “prices” for different types of operations
  - The prices are the amortized cost of the operations
  - Different operations may have different amortized costs
- Saving:
  - Some operations have price higher than its actual cost: save credits
  - Some operations have price lower than its actual cost: withdraw credits
  - Always make sure that the saving is non-negative:  $\sum^n_{i=1}a_i -\sum^n_{i=1}t_i\ge 0$

*Tips:*
Step 1: decide the amortized cost $a_i$ for each (types) of the operations
- You may have to make several guesses and check if any of them helps you to have low amortized cost
Step 2: Prove that your amortized cost is valid, that is, for all $n, \sum^n_{i=1}a_i -\sum^n_{i=1}t_i\ge 0$
- As long as the inequality holds for all $n$, the amortized cost is valid
- The goal is to find the best “prices” for the operations such that the total amortized cost is low while the inequality holds

*Potential function stuff:* Amortized analysis is for data structures where expensive operations happen only when there are many cheap operations

There are risky situations that the next operation might be expensive
- In Super stack: when there are many items in the stack, the next MULTI-POP( ) can be expensive
- After these expensive operations, the data structure is safe again

Instead of associationg cost with particular operations or pieces of the data structure, we define a potential function on the entire data structure.
- The potential function maps the *configuration* of the current data structure to a real number (the *potential*)
- We aim to absorb the expensive cost by the *potential change*.

Let $D_i$ denote our data structure configuration after ith the operation has been performed, and $\Phi$ let  denote its potential.

The amortized cost of the i-th operation $a_i=t_i+\Phi_i-\Phi_{i-1}$

Where $t_i$ is the actual cost of the i-th operation
- A potential function is valid if for any i:
- $\sum^n_{i=1} a_i= \sum^n_{i=1} (t_i+\Phi_i-\Phi_{i-1})= (\sum^n_{i=1} t_i)+\Phi_n-\Phi_{0}\ge \sum^n_{i=1}t_i$

We define a potential function which takes the current “configuration” of the data structure as a parameter and maps it to a real number (potential).

The amortized cost of an operation is the sum of its actual cost and the potential change due to this operation. The potential function is carefully designed such that when the actual cost is high, the potential is decreased and can compensate for the high cost.

*Fibonacci-heap*
- Simply add as a single tree, assign min to it if it is the lowest
- Union simply add the forests together
- Delete is simply a decrease key with infinite and an extract-min
- DECREASE-KEY(heap H, node x, target_key k): given a specified node x (by a pointer), lower its key to the value k
#+begin_src c
DECREASE-KEY(heap H, node x, target_key k){
    Change the key value x of to k
    If k is smaller than the key of x’s parent p
        Cut x from p
        CASCADING-CUT(H, p)
    Update min(H)}

CASCADING-CUT(heap H, node x){
    If x is not marked
        Mark x
    Else
        Cut x from its parent p, unmark x
        CASCADING-CUT( H, p)}
#+end_src
- =EXTRACT-MIN(heap H)=: return the minimum value and remove it from H
#+begin_src c
EXTRACT-MIN(heap H){
  Delete the min node y from H
  For each child z of y
    The subtree rooted on z is a new tree in H
    unmark z
  Consolidate(H)
  Update min(H)
}

Consolidate(heap H){
  For i = 0 to max-degree(h)
    Pair the trees with order i and make the one
    with larger root-key value a new child of the
    other one
}
#+end_src

*** Minimum spanning trees and Union find
Example minimum spanning tree: connect the cities with as little cost as possible

Terminologies:
- *Span:* a subset of edges that connects al the vertices
- *Spanning tree:* the subset of edges is acyclic and connects all the vertices
- *Minimum spanning tree:* the spanning tree $T$ such that total weight $w(T)=\sum_{(u,v)\in F}w(u,v)$
  - There can be multiple minimum spanning tree in a graph

If all edge weights in the given graph are different, the minimum spanning tree is unique.

A *light edge* for a component $C$ is an edge $(u, v)$ such that there is exactly one endpoint in $C$ and has the minimum weight. A light edge can be safely added, it is part fo the minimum spanning tree

*Boruvka's algorit* is quite simple:
#+begin_src c
while F is not a spanning tree do
    Add all light edges
#+end_src

*Prim’s algorithm* starts at an arbitrary vertex and repeatedly adds its light edge.

So just repeatedly add the outgoing edge with the lowest weight that connects a new vertex.
#+begin_src c
Start at a singleton T
Repeatedly adding the light edge of T to F
#+end_src

We keep all the outgoing edges from T in a priority queue Q, acoording to the edge weights.

We can also use a fibonacci heap instead, in which we store the vertices instead of the edges. Where the value of v is the minimum edge weight between v and the evolving tree.

*Disjoint set* a datastructure to store elements each of which belong to exactly one set. Needed to implement kruskal efficiently.
1. Using linked lists: A link to the next element an to the first element, indicating the set a element belongs to
2. Using a forest: each set is its own tree, top of the tree indicates the set it belongs too

#+begin_src c
Kruskal(G):
  Scan all edges by increasing weight
  if an edge is light for some component
    add it to F
#+end_src

The algorithms for minimum spanning tree also work for graphs where some edges have equal weights, as long as we have a consistent method for breaking ties when choosing the light edge.

