cheatsheat.html
<div id="outline-container-org329582a" class="outline-2">
<h2 id="org329582a"><span class="section-number-2">3.</span> Amortized analysis</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Amortized analysis:</b> Find the amortized time complexity \(a^i\) for the i&rsquo;th operation such that \(\sum^n_{i=1}t_i \le\sum^n_{i=1}a_i \le f(n)\)
</p>


<p>
<b>Aggregate method</b> is a method to find the amortized complexity of a operation.
</p>

<p>
\[\text{amortized time for each operation} = \frac{\text{total time complexity}}{\text{number of operations}}\]
</p>

<ol class="org-ol">
<li>Calculate the total time complexity over the sequence of operations
<ul class="org-ul">
<li>You may need some parameters to help you calculate
<ul class="org-ul">
<li>There are PUSHs in the super stack example</li>
</ul></li>
</ul></li>
<li>Divide the total time complexity by the number of the operations. The result is the amortized cost per operation
<ul class="org-ul">
<li>Using aggregate method, every operation has the same amortized cost</li>
</ul></li>
</ol>

<p>
<b>Accounting method</b> is a method to find the amortized complexity of a operation.
</p>
<ul class="org-ul">
<li>Instead of averaging the cost evenly on each of the operations, we design the “prices” for different types of operations
<ul class="org-ul">
<li>The prices are the amortized cost of the operations</li>
<li>Different operations may have different amortized costs</li>
</ul></li>
<li>Saving:
<ul class="org-ul">
<li>Some operations have price higher than its actual cost: save credits</li>
<li>Some operations have price lower than its actual cost: withdraw credits</li>
<li>Always make sure that the saving is non-negative:  \(\sum^n_{i=1}a_i -\sum^n_{i=1}t_i\ge 0\)</li>
</ul></li>
</ul>

<p>
<b>Tips:</b>
Step 1: decide the amortized cost \(a_i\) for each (types) of the operations
</p>
<ul class="org-ul">
<li>You may have to make several guesses and check if any of them helps you to have low amortized cost</li>
</ul>
<p>
Step 2: Prove that your amortized cost is valid, that is, for all \(n, \sum^n_{i=1}a_i -\sum^n_{i=1}t_i\ge 0\)
</p>
<ul class="org-ul">
<li>As long as the inequality holds for all \(n\), the amortized cost is valid</li>
<li>The goal is to find the best “prices” for the operations such that the total amortized cost is low while the inequality holds</li>
</ul>

<p>
<b>Potential function stuff:</b> Amortized analysis is for data structures where expensive operations happen only when there are many cheap operations
</p>

<p>
There are risky situations that the next operation might be expensive
</p>
<ul class="org-ul">
<li>In Super stack: when there are many items in the stack, the next MULTI-POP( ) can be expensive</li>
<li>After these expensive operations, the data structure is safe again</li>
</ul>

<p>
Instead of associationg cost with particular operations or pieces of the data structure, we define a potential function on the entire data structure.
</p>
<ul class="org-ul">
<li>The potential function maps the <b>configuration</b> of the current data structure to a real number (the <b>potential</b>)</li>
<li>We aim to absorb the expensive cost by the <b>potential change</b>.</li>
</ul>

<p>
Let \(D_i\) denote our data structure configuration after ith the operation has been performed, and \(\Phi\) let  denote its potential.
</p>

<p>
The amortized cost of the i-th operation \(a_i=t_i+\Phi_i-\Phi_{i-1}\)
</p>

<p>
Where \(t_i\) is the actual cost of the i-th operation
</p>
<ul class="org-ul">
<li>A potential function is valid if for any i:</li>
<li>\(\sum^n_{i=1} a_i= \sum^n_{i=1} (t_i+\Phi_i-\Phi_{i-1})= (\sum^n_{i=1} t_i)+\Phi_n-\Phi_{0}\ge \sum^n_{i=1}t_i\)</li>
</ul>

<p>
We define a potential function which takes the current “configuration” of the data structure as a parameter and maps it to a real number (potential).
</p>

<p>
The amortized cost of an operation is the sum of its actual cost and the potential change due to this operation. The potential function is carefully designed such that when the actual cost is high, the potential is decreased and can compensate for the high cost.
</p>

<p>
<b>Fibonacci-heap</b>
</p>
<ul class="org-ul">
<li>Simply add as a single tree, assign min to it if it is the lowest</li>
<li>Union simply add the forests together</li>
<li>Delete is simply a decrease key with infinite and an extract-min</li>
<li>DECREASE-KEY(heap H, node x, target<sub>key</sub> k): given a specified node x (by a pointer), lower its key to the value k</li>
</ul>
<div class="org-src-container">
<pre class="src src-c">DECREASE-KEY(<span style="color: #f9e2af;">heap</span> <span style="color: #cdd6f4;">H</span>, <span style="color: #f9e2af;">node</span> <span style="color: #cdd6f4;">x</span>, target_key k){
    Change the key value x of to k
    If k is smaller than the key of x&#8217;s parent p
        Cut x from p
        CASCADING-CUT(H, p)
    <span style="color: #f9e2af;">Update</span> <span style="color: #89b4fa;">min</span>(H)}

CASCADING-CUT(<span style="color: #f9e2af;">heap</span> <span style="color: #cdd6f4;">H</span>, node x){
    If x is not marked
        Mark x
    Else
        Cut x from its <span style="color: #f9e2af;">parent</span> <span style="color: #cdd6f4;">p</span>, <span style="color: #cdd6f4;">unmark</span> x
        CASCADING-CUT( H, p)}
</pre>
</div>
<ul class="org-ul">
<li><code>EXTRACT-MIN(heap H)</code>: return the minimum value and remove it from H</li>
</ul>
<div class="org-src-container">
<pre class="src src-c">EXTRACT-MIN(heap H){
  Delete the min node y from H
  For each child z of y
    The subtree rooted on z is a new tree in H
    unmark <span style="color: #f9e2af;">z</span>
  <span style="color: #89b4fa;">Consolidate</span>(H)
  <span style="color: #f9e2af;">Update</span> <span style="color: #89b4fa;">min</span>(H)
}

<span style="color: #89b4fa;">Consolidate</span>(<span style="color: #f9e2af;">heap</span> <span style="color: #cdd6f4;">H</span>){
  <span style="color: #f9e2af;">For</span> <span style="color: #cdd6f4;">i</span> = <span style="color: #fab387;">0</span> to max-degree(h)
    Pair the trees with order i and make the one
    with larger root-key value a new child of the
    other one
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org686b043" class="outline-2">
<h2 id="org686b043"><span class="section-number-2">4.</span> Minimum spanning trees and Union find</h2>
<div class="outline-text-2" id="text-4">
<p>
Example minimum spanning tree: connect the cities with as little cost as possible
</p>

<p>
Terminologies:
</p>
<ul class="org-ul">
<li><b>Span:</b> a subset of edges that connects al the vertices</li>
<li><b>Spanning tree:</b> the subset of edges is acyclic and connects all the vertices</li>
<li><b>Minimum spanning tree:</b> the spanning tree \(T\) such that total weight \(w(T)=\sum_{(u,v)\in F}w(u,v)\)
<ul class="org-ul">
<li>There can be multiple minimum spanning tree in a graph</li>
</ul></li>
</ul>

<p>
If all edge weights in the given graph are different, the minimum spanning tree is unique.
</p>

<p>
A <b>light edge</b> for a component \(C\) is an edge \((u, v)\) such that there is exactly one endpoint in \(C\) and has the minimum weight. A light edge can be safely added, it is part fo the minimum spanning tree
</p>

<p>
<b>Boruvka&rsquo;s algorit</b> is quite simple:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #cba6f7;">while</span> F is not a spanning tree <span style="color: #cba6f7;">do</span>
    Add all light edges
</pre>
</div>

<p>
<b>Prim’s algorithm</b> starts at an arbitrary vertex and repeatedly adds its light edge.
</p>

<p>
So just repeatedly add the outgoing edge with the lowest weight that connects a new vertex.
</p>
<div class="org-src-container">
<pre class="src src-c">Start at a singleton T
Repeatedly adding the light edge of T to F
</pre>
</div>

<p>
We keep all the outgoing edges from T in a priority queue Q, acoording to the edge weights.
</p>

<p>
We can also use a fibonacci heap instead, in which we store the vertices instead of the edges. Where the value of v is the minimum edge weight between v and the evolving tree.
</p>

<p>
<b>Disjoint set</b> a datastructure to store elements each of which belong to exactly one set. Needed to implement kruskal efficiently.
</p>
<ol class="org-ol">
<li>Using linked lists: A link to the next element an to the first element, indicating the set a element belongs to</li>
<li>Using a forest: each set is its own tree, top of the tree indicates the set it belongs too</li>
</ol>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #89b4fa;">Kruskal</span>(G):
  Scan all edges by increasing weight
  <span style="color: #cba6f7;">if</span> an edge is light <span style="color: #cba6f7;">for</span> some component
    add it to F
</pre>
</div>

<p>
The algorithms for minimum spanning tree also work for graphs where some edges have equal weights, as long as we have a consistent method for breaking ties when choosing the light edge.
</p>
</div>
</div>
