cheatsheat.org
*** NP-completeness
*Decision problems:* solution is a yes/no answer.
- Example subset-sum: Given an set of integers, is there a sbuset such that the sum of the elements in T is equal to t

*Optimization problems:* minimize or maximize some objective

We define *input size* as the number of bits needed to encode it.

Given an algorithm, its *time complexity* is a function f where f (n) is the maximum number of steps that the algorithm takes on any input of length n.

The class *P* is the set of decision problems that can be solved in polynomial time.

To show that a problem is in P, on should design an algorithm that correctly solves the problem and show that this algorithm finishes in time that polynomial in the input length for any input.

The problems in class p are restricted to decisions problems. We can make an *equivalent decision version of optimization problems* by introducing an extra parameter as a threshold of the object.

For some problems, solving them directly is difficult. But if someone somehow discovered the solution it is easy to verify.

The concept of *verify* is to use an extra piece of information to check if the answer to a problem instance is yes.
- Called a *certificate* or *proof*

If there exists a polynomial-time algorithm that can verify any yes-instance of a problem, its *polynomial time verifiable*.

The class *NP* is the set of decision problems that can be verified in polynomial time.

To show that a problem is in NP, one should design a polynomial-time algorithm that correctly verifies any yes-instance using a certificate, where the certificate needs to be defined by the prover. The proof consists of three parts:
1. Show that for every yes-instance of A, there is a certificate c.
2. Design a verifier algorithm that answers to the instance is yes using c.
3. Show that this verifier algorithm can be run in polynomial time in the input length.

A *reduction* is a way of converting one problem to another such that a solution to the second problem can be used to solve the first problem.

A problem $A$ is *polynomial-time reducible* to problem B, written $A \le_P B$, if a polynomial-time computable function $f$ exists, where for every instance $w$ of $A$, $w$ is a yes-instance of $A$ if and only if $f (w)$ is a yes-instance of $B$. The function $f$ is called the polynomial-time reduction of $A$ to $B$.

A problem is *NP-hard* if all problems in NP are polynomial-time reducible to it.

There are a few problems in NP that if they can be solved in polynomial time, then $P=NP$. These problems are called *NP-Complete*: problem is in NP and NP-Hard

NP-Completeness proof.
- To show that a problem B is NP-complete, we have to show that it is in NP and NP-hard.
- By the definition of NP-hardness, we have to show that every problem in NP is polynomial-time reducible to B, which is difficult.
- We can instead show that there exists some NP-complete problem A that reduces to B in polynomial time.
- Since A is NP-complete, it is NP-hard, and every problem in NP can be reduced to A in polynomial time.
- Therefore, every problem in NP can be polynomial-time reduced to A first and then polynomial-time reduced to B.
- That is, there is a polynomial-time reduction from any problem in NP to B.

*Approximation algorithms:* Instead of finding the exact solution we find near-optimal solutions efficiently.
- Spend polynomial time to get a solution with some guarantee that it won’t be too much worse than the real optimal solution

We use *approximation ratio* measure how “far” the solution of the approximation algorithm $ALG(I)$ is from the optimal solution $OPT(I)$
- $ALG(I)$: the "cost" of the approximation algorithm on input I
- $OPT(I)$: the "cost" of the optimal algorithm on input I
- The definition of cost here is confusing, this isn't referring to running time of the algorithm but of how optimal the solution is
  - Each potential solution has a positive cost, depending on the problem we want to minimize or maximize the cost.
- *Minimization problems*: the *approximation ratio* of the algorithm is $\max_I\frac{ALG(I)}{OPT(I)}$ for all instance $I$
- *Maximization problems*: the *approximation ratio* of the algorithm is $\max_I\frac{OPT(I)}{ALG(I)}$ for all instance $I$

We say that the algorithm is a $\alpha$-approximation algorithm if $\text{approximation ratio}\le \alpha$ for any instance $I$.

To analyze the performance of a aprroximation algorithm we need to now it is *feasible* the algorithm returns a correct (but possibly not optimal) solution, and the approximation ratio, to show it is not to far of.

*** String Matching
Gegeven string (*haystack*) zoek alle voorkomens van een patroon (*needle*)
- Tekst $A[0..n-1]$, patroon $P[0..m-1]$
- Wil: k zodat $A[k..k+m]=P[0..m-1]$
- Tekst is over alfabet $\Sigma (\{0,1\},\{A,B,...,Z\},[0,255],\text{etc})$

Algemeen: $H(K+1)=A[k+m+1]+|\Sigma |*(H(k)-A[k]*|\Sigma|^{m-1})$
- $H(K+1)=A[k+m+1]+H(k)*|\Sigma |-A[k]*|\Sigma|^{m}$

De getallen kunnen aardig groot worden, daarom gebruiken we modulo, als een module matched checken we daarna de echte match.

#+begin_src python
RK4(A,P)
    ph := String2Int(P) % q
    sh := String2Int(A[0…m-1]) % q
    for k := 0 to n-m-1
        if (ph == sh) and CheckMatch(A,k,P)
            output k
    sh := A[k+m+1] + sh × Σ – A[k] × Σ^m % q
return
#+end_src

*Eindige automaat:*

#+begin_src python
DFA-Match(A,P)
    s := 0
    δ := overgangsfunctie van P
    for i := 0 to n-1
        s := δ(s, A[i])
        if s = m
            output i-m+1
    return
#+end_src

Overgangsfunctie:
- $\delta (i,x) =$ wat is de volgende toestand als we x lezen en nu in toestand i zijn?
- $i+1$ als $x=P[i]$
- de grootste $j\le i$ zodat $P[i-j..i-1]=P[0..j-2]$ en $P[j-1]=x$
- start-toestand indien zo’n $j$ niet bestaat
- Naief: $O(m^3|\Sigma |)$, kan in: $O(m|\Sigma |)$
