cheatsheat.html
<div id="outline-container-org13e479b" class="outline-2">
<h2 id="org13e479b"><span class="section-number-2">5.</span> NP-completeness</h2>
<div class="outline-text-2" id="text-5">
<p>
<b>Decision problems:</b> solution is a yes/no answer.
</p>
<ul class="org-ul">
<li>Example subset-sum: Given an set of integers, is there a sbuset such that the sum of the elements in T is equal to t</li>
</ul>

<p>
<b>Optimization problems:</b> minimize or maximize some objective
</p>

<p>
We define <b>input size</b> as the number of bits needed to encode it.
</p>

<p>
Given an algorithm, its <b>time complexity</b> is a function f where f (n) is the maximum number of steps that the algorithm takes on any input of length n.
</p>

<p>
The class <b>P</b> is the set of decision problems that can be solved in polynomial time.
</p>

<p>
To show that a problem is in P, on should design an algorithm that correctly solves the problem and show that this algorithm finishes in time that polynomial in the input length for any input.
</p>

<p>
The problems in class p are restricted to decisions problems. We can make an <b>equivalent decision version of optimization problems</b> by introducing an extra parameter as a threshold of the object.
</p>

<p>
For some problems, solving them directly is difficult. But if someone somehow discovered the solution it is easy to verify.
</p>

<p>
The concept of <b>verify</b> is to use an extra piece of information to check if the answer to a problem instance is yes.
</p>
<ul class="org-ul">
<li>Called a <b>certificate</b> or <b>proof</b></li>
</ul>

<p>
If there exists a polynomial-time algorithm that can verify any yes-instance of a problem, its <b>polynomial time verifiable</b>.
</p>

<p>
The class <b>NP</b> is the set of decision problems that can be verified in polynomial time.
</p>

<p>
To show that a problem is in NP, one should design a polynomial-time algorithm that correctly verifies any yes-instance using a certificate, where the certificate needs to be defined by the prover. The proof consists of three parts:
</p>
<ol class="org-ol">
<li>Show that for every yes-instance of A, there is a certificate c.</li>
<li>Design a verifier algorithm that answers to the instance is yes using c.</li>
<li>Show that this verifier algorithm can be run in polynomial time in the input length.</li>
</ol>

<p>
A <b>reduction</b> is a way of converting one problem to another such that a solution to the second problem can be used to solve the first problem.
</p>

<p>
A problem \(A\) is <b>polynomial-time reducible</b> to problem B, written \(A \le_P B\), if a polynomial-time computable function \(f\) exists, where for every instance \(w\) of \(A\), \(w\) is a yes-instance of \(A\) if and only if \(f (w)\) is a yes-instance of \(B\). The function \(f\) is called the polynomial-time reduction of \(A\) to \(B\).
</p>

<p>
A problem is <b>NP-hard</b> if all problems in NP are polynomial-time reducible to it.
</p>

<p>
There are a few problems in NP that if they can be solved in polynomial time, then \(P=NP\). These problems are called <b>NP-Complete</b>: problem is in NP and NP-Hard
</p>

<p>
NP-Completeness proof.
</p>
<ul class="org-ul">
<li>To show that a problem B is NP-complete, we have to show that it is in NP and NP-hard.</li>
<li>By the definition of NP-hardness, we have to show that every problem in NP is polynomial-time reducible to B, which is difficult.</li>
<li>We can instead show that there exists some NP-complete problem A that reduces to B in polynomial time.</li>
<li>Since A is NP-complete, it is NP-hard, and every problem in NP can be reduced to A in polynomial time.</li>
<li>Therefore, every problem in NP can be polynomial-time reduced to A first and then polynomial-time reduced to B.</li>
<li>That is, there is a polynomial-time reduction from any problem in NP to B.</li>
</ul>

<p>
<b>Approximation algorithms:</b> Instead of finding the exact solution we find near-optimal solutions efficiently.
</p>
<ul class="org-ul">
<li>Spend polynomial time to get a solution with some guarantee that it won’t be too much worse than the real optimal solution</li>
</ul>

<p>
We use <b>approximation ratio</b> measure how “far” the solution of the approximation algorithm \(ALG(I)\) is from the optimal solution \(OPT(I)\)
</p>
<ul class="org-ul">
<li>\(ALG(I)\): the &ldquo;cost&rdquo; of the approximation algorithm on input I</li>
<li>\(OPT(I)\): the &ldquo;cost&rdquo; of the optimal algorithm on input I</li>
<li>The definition of cost here is confusing, this isn&rsquo;t referring to running time of the algorithm but of how optimal the solution is
<ul class="org-ul">
<li>Each potential solution has a positive cost, depending on the problem we want to minimize or maximize the cost.</li>
</ul></li>
<li><b>Minimization problems</b>: the <b>approximation ratio</b> of the algorithm is \(\max_I\frac{ALG(I)}{OPT(I)}\) for all instance \(I\)</li>
<li><b>Maximization problems</b>: the <b>approximation ratio</b> of the algorithm is \(\max_I\frac{OPT(I)}{ALG(I)}\) for all instance \(I\)</li>
</ul>

<p>
We say that the algorithm is a $&alpha;$-approximation algorithm if \(\text{approximation ratio}\le \alpha\) for any instance \(I\).
</p>

<p>
To analyze the performance of a aprroximation algorithm we need to now it is <b>feasible</b> the algorithm returns a correct (but possibly not optimal) solution, and the approximation ratio, to show it is not to far of.
</p>
</div>
</div>
<div id="outline-container-org22feb18" class="outline-2">
<h2 id="org22feb18"><span class="section-number-2">6.</span> String Matching</h2>
<div class="outline-text-2" id="text-6">
<p>
Gegeven string (<b>haystack</b>) zoek alle voorkomens van een patroon (<b>needle</b>)
</p>
<ul class="org-ul">
<li>Tekst \(A[0..n-1]\), patroon \(P[0..m-1]\)</li>
<li>Wil: k zodat \(A[k..k+m]=P[0..m-1]\)</li>
<li>Tekst is over alfabet \(\Sigma (\{0,1\},\{A,B,...,Z\},[0,255],\text{etc})\)</li>
</ul>

<p>
Algemeen: \(H(K+1)=A[k+m+1]+|\Sigma |*(H(k)-A[k]*|\Sigma|^{m-1})\)
</p>
<ul class="org-ul">
<li>\(H(K+1)=A[k+m+1]+H(k)*|\Sigma |-A[k]*|\Sigma|^{m}\)</li>
</ul>

<p>
De getallen kunnen aardig groot worden, daarom gebruiken we modulo, als een module matched checken we daarna de echte match.
</p>

<div class="org-src-container">
<pre class="src src-python">RK4(A,P)
    ph :<span style="color: #89dceb;">=</span> String2Int(P) <span style="color: #89dceb;">%</span> q
    sh :<span style="color: #89dceb;">=</span> String2Int(A[<span style="color: #fab387;">0</span>&#8230;m<span style="color: #89dceb;">-</span><span style="color: #fab387;">1</span>]) <span style="color: #89dceb;">%</span> q
    <span style="color: #cba6f7;">for</span> k :<span style="color: #89dceb;">=</span> <span style="color: #fab387;">0</span> to n<span style="color: #89dceb;">-</span>m<span style="color: #89dceb;">-</span><span style="color: #fab387;">1</span>
        <span style="color: #cba6f7;">if</span> (ph <span style="color: #89dceb;">==</span> sh) <span style="color: #cba6f7;">and</span> CheckMatch(A,k,P)
            output k
    sh :<span style="color: #89dceb;">=</span> A[k<span style="color: #89dceb;">+</span>m<span style="color: #89dceb;">+</span><span style="color: #fab387;">1</span>] <span style="color: #89dceb;">+</span> sh &#215; &#931; &#8211; A[k] &#215; &#931;<span style="color: #89dceb;">^</span>m <span style="color: #89dceb;">%</span> q
<span style="color: #cba6f7;">return</span>
</pre>
</div>

<p>
<b>Eindige automaat:</b>
</p>

<div class="org-src-container">
<pre class="src src-python">DFA<span style="color: #89dceb;">-</span>Match(A,P)
    s :<span style="color: #89dceb;">=</span> <span style="color: #fab387;">0</span>
    &#948; :<span style="color: #89dceb;">=</span> overgangsfunctie van P
    <span style="color: #cba6f7;">for</span> i :<span style="color: #89dceb;">=</span> <span style="color: #fab387;">0</span> to n<span style="color: #89dceb;">-</span><span style="color: #fab387;">1</span>
        s :<span style="color: #89dceb;">=</span> &#948;(s, A[i])
        <span style="color: #cba6f7;">if</span> s <span style="color: #89dceb;">=</span> m
            output i<span style="color: #89dceb;">-</span>m<span style="color: #89dceb;">+</span><span style="color: #fab387;">1</span>
    <span style="color: #cba6f7;">return</span>
</pre>
</div>

<p>
Overgangsfunctie:
</p>
<ul class="org-ul">
<li>\(\delta (i,x) =\) wat is de volgende toestand als we x lezen en nu in toestand i zijn?</li>
<li>\(i+1\) als \(x=P[i]\)</li>
<li>de grootste \(j\le i\) zodat \(P[i-j..i-1]=P[0..j-2]\) en \(P[j-1]=x\)</li>
<li>start-toestand indien zo’n \(j\) niet bestaat</li>
<li>Naief: \(O(m^3|\Sigma |)\), kan in: \(O(m|\Sigma |)\)</li>
</ul>
</div>
</div>
