cheatsheat.org
*** Gerandomiseerde algoritmes
Er zijn twee types gerandomiseerde algoritmes:

*Las Vegas algoritme:*
- Geeft altijd een correct ja/nee antwoord of oplossing
- Verwachte looptijd is eindig/beperkt
- Intuïtie: we gokken met hoeveel rekentijd we gebruiken, maar niet met het antwoord

*Monte Carlo algoritme:*
- Geeft niet altijd een correct antwoord
  - Eenzijdige fout of tweezijdige fout
  - Wel grote kans op goed antwoord
- Worst-case looptijd is eindig/beperkt
- Intuïtie: we gokken met het antwoord, maar niet met hoeveel looptijd we nodig hebben
