cheatsheat.html
<div id="outline-container-org54d3a23" class="outline-2">
<h2 id="org54d3a23"><span class="section-number-2">7.</span> Gerandomiseerde algoritmes</h2>
<div class="outline-text-2" id="text-7">
<p>
Er zijn twee types gerandomiseerde algoritmes:
</p>

<p>
<b>Las Vegas algoritme:</b>
</p>
<ul class="org-ul">
<li>Geeft altijd een correct ja/nee antwoord of oplossing</li>
<li>Verwachte looptijd is eindig/beperkt</li>
<li>Intuïtie: we gokken met hoeveel rekentijd we gebruiken, maar niet met het antwoord</li>
</ul>

<p>
<b>Monte Carlo algoritme:</b>
</p>
<ul class="org-ul">
<li>Geeft niet altijd een correct antwoord
<ul class="org-ul">
<li>Eenzijdige fout of tweezijdige fout</li>
<li>Wel grote kans op goed antwoord</li>
</ul></li>
<li>Worst-case looptijd is eindig/beperkt</li>
<li>Intuïtie: we gokken met het antwoord, maar niet met hoeveel looptijd we nodig hebben</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: martijnV</p>
<p class="date">Created: 2024-04-07 Sun 22:07</p>
</div>
</body>
</html>
